ch32-riscv-ug/ArduinoCore-CH32/variants/CH32X315/pins_arduino.h
/* ---- ADC1 analog inputs (12 channels) ---- */
#define NUM_ANALOG_INPUTS 12
#define A0   PA2
#define A1   PA3
#define A2   PA4
#define A3   PA5
#define A4   PA6
#define A5   PA7
#define A6   PB0
#define A7   PB1
#define A8   PB2
#define A9   PB3
#define A10  PB4
#define A11  PB5
#define CH32_PIN_TO_ADC_CHANNEL(p) ( \
    (p) == PA2 ? 0 : \
    (p) == PA3 ? 1 : \
    (p) == PA4 ? 2 : \
    (p) == PA5 ? 3 : \
    (p) == PA6 ? 4 : \
    (p) == PA7 ? 5 : \
    (p) == PB0 ? 6 : \
    (p) == PB1 ? 7 : \
    (p) == PB2 ? 8 : \
    (p) == PB3 ? 9 : \
    (p) == PB4 ? 10 : \
    (p) == PB5 ? 11 : \
    NOT_AN_ANALOG_PIN)
#define CH32_ADC_CHANNEL_TO_PIN(c) ( \
    (c) == 0 ? PA2 : \
    (c) == 1 ? PA3 : \
    (c) == 2 ? PA4 : \
    (c) == 3 ? PA5 : \
    (c) == 4 ? PA6 : \
    (c) == 5 ? PA7 : \
    (c) == 6 ? PB0 : \
    (c) == 7 ? PB1 : \
    (c) == 8 ? PB2 : \
    (c) == 9 ? PB3 : \
    (c) == 10 ? PB4 : \
    (c) == 11 ? PB5 : \
    NOT_A_PIN)

/* ---- USART pins (device-data; one route per USART, chosen for
 *      the whole series - see choose_uarts in generate.py) ---- */
/* USART1: route af-1, on every part */
#define CH32_SERIAL1_TX PD4
#define CH32_SERIAL1_RX PD5
/* device-data lists PA11, PC4, PD4, PD8 for TX on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
/* device-data lists PA10, PA12, PC5, PD5, PD9 for RX on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
#define CH32_SERIAL1_HANDLER USART1_IRQHandler
#define CH32_SERIAL1_CLKEN_ADDR 0x40021018u
#define CH32_SERIAL1_CLKEN_MASK 0x00004000u
#define CH32_SERIAL1_IRQ CH32_IRQN_USART1
/* NOTE: route af-1 is a per-pin alternate-function
 * selector, not an AFIO remap. The core does not program it
 * yet, so this port needs verifying (docs/todo.ja.md). */
/* USART2: route af-1, on every part */
#define CH32_SERIAL2_TX PD6
#define CH32_SERIAL2_RX PD7
/* device-data lists PA4, PD6, PC12 for TX on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
/* device-data lists PA5, PD7, PC13 for RX on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
#define CH32_SERIAL2_HANDLER USART2_IRQHandler
#define CH32_SERIAL2_CLKEN_ADDR 0x4002101cu
#define CH32_SERIAL2_CLKEN_MASK 0x00020000u
#define CH32_SERIAL2_IRQ CH32_IRQN_USART2
/* NOTE: route af-1 is a per-pin alternate-function
 * selector, not an AFIO remap. The core does not program it
 * yet, so this port needs verifying (docs/todo.ja.md). */
/* USART3: route af-1, on every part */
#define CH32_SERIAL3_TX PC8
#define CH32_SERIAL3_RX PC9
/* device-data lists PA13, PC8 for TX on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
/* device-data lists PA14, PC9 for RX on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
#define CH32_SERIAL3_HANDLER USART3_IRQHandler
#define CH32_SERIAL3_CLKEN_ADDR 0x4002101cu
#define CH32_SERIAL3_CLKEN_MASK 0x00040000u
#define CH32_SERIAL3_IRQ CH32_IRQN_USART3
/* NOTE: route af-1 is a per-pin alternate-function
 * selector, not an AFIO remap. The core does not program it
 * yet, so this port needs verifying (docs/todo.ja.md). */
/* USART4: route af-1, on every part */
#define CH32_SERIAL4_TX PA8
#define CH32_SERIAL4_RX PA9
/* device-data lists PA8, PB12 for TX on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
/* device-data lists PA9, PB13 for RX on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
#define CH32_SERIAL4_HANDLER USART4_IRQHandler
#define CH32_SERIAL4_CLKEN_ADDR 0x4002101cu
#define CH32_SERIAL4_CLKEN_MASK 0x00080000u
#define CH32_SERIAL4_IRQ CH32_IRQN_USART4
/* NOTE: route af-1 is a per-pin alternate-function
 * selector, not an AFIO remap. The core does not program it
 * yet, so this port needs verifying (docs/todo.ja.md). */
#ifndef CH32_SERIAL_DEFAULT
#define CH32_SERIAL_DEFAULT 1
#endif

/* ---- I2C pins (device-data; one route per instance,
 *      chosen for the whole series - see choose_i2cs) ---- */
/* I2C1: route af-3, on every part */
#define CH32_I2C1_SCL PD4
#define CH32_I2C1_SDA PD5
#define CH32_I2C1_CLKEN_ADDR 0x4002101cu
#define CH32_I2C1_CLKEN_MASK 0x00200000u
/* device-data lists PA0, PA14, PA8, PD4, PB14, PC14 for SCL on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
/* device-data lists PA1, PA13, PA9, PD5, PB15, PC15 for SDA on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
/* NOTE: route af-3 is a per-pin alternate-function
 * selector, not an AFIO remap. The core does not program it
 * yet, so this instance needs verifying (docs/todo.ja.md). */
/* I2C2: route af-3, on every part */
#define CH32_I2C2_SCL PD6
#define CH32_I2C2_SDA PD7
#define CH32_I2C2_CLKEN_ADDR 0x4002101cu
#define CH32_I2C2_CLKEN_MASK 0x00400000u
/* device-data lists PA11, PB9, PD6, PC10 for SCL on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
/* device-data lists PA12, PB10, PD7, PC11 for SDA on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
/* NOTE: route af-3 is a per-pin alternate-function
 * selector, not an AFIO remap. The core does not program it
 * yet, so this instance needs verifying (docs/todo.ja.md). */
/* Arduino's standard names for the first bus (Wire). */
#ifndef PIN_WIRE_SCL
#define PIN_WIRE_SCL CH32_I2C1_SCL
#define PIN_WIRE_SDA CH32_I2C1_SDA
#define SCL PIN_WIRE_SCL
#define SDA PIN_WIRE_SDA
#endif

/* ---- SPI pins (device-data; one route per instance,
 *      chosen for the whole series - see choose_spis).
 *      NSS is not listed: Arduino drives chip select as a GPIO. ---- */
/* SPI1: route af-4, on every part */
#define CH32_SPI1_SCK PA5
#define CH32_SPI1_MISO PD3
#define CH32_SPI1_MOSI PA6
#define CH32_SPI1_CLKEN_ADDR 0x40021018u
#define CH32_SPI1_CLKEN_MASK 0x00001000u
/* device-data lists PA13, PA5, PB1 for SCK on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
/* device-data lists PA15, PA7, PD3, PB3, PD14 for MISO on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
/* device-data lists PA14, PA6, PD2, PB2 for MOSI on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
/* NOTE: route af-4 is a per-pin alternate-function
 * selector, not an AFIO remap. The core does not program it
 * yet, so this instance needs verifying (docs/todo.ja.md). */
/* SPI2: route af-4, on every part */
#define CH32_SPI2_SCK PB5
#define CH32_SPI2_MISO PB7
#define CH32_SPI2_MOSI PB6
#define CH32_SPI2_CLKEN_ADDR 0x4002101cu
#define CH32_SPI2_CLKEN_MASK 0x00004000u
/* device-data lists PB13, PB5 for SCK on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
/* device-data lists PB15, PB7 for MISO on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
/* device-data lists PB14, PB6 for MOSI on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
/* NOTE: route af-4 is a per-pin alternate-function
 * selector, not an AFIO remap. The core does not program it
 * yet, so this instance needs verifying (docs/todo.ja.md). */
/* SPI3: route af-4, on every part */
#define CH32_SPI3_SCK PC9
#define CH32_SPI3_MISO PD13
#define CH32_SPI3_MOSI PD12
#define CH32_SPI3_CLKEN_ADDR 0x4002101cu
#define CH32_SPI3_CLKEN_MASK 0x00008000u
/* device-data lists PC5, PC9, PD11 for SCK on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
/* device-data lists PC7, PD13, PC11 for MISO on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
/* device-data lists PC6, PD12, PC10 for MOSI on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
/* NOTE: route af-4 is a per-pin alternate-function
 * selector, not an AFIO remap. The core does not program it
 * yet, so this instance needs verifying (docs/todo.ja.md). */
/* Arduino's standard names for the first bus (SPI). */
#ifndef PIN_SPI_SCK
#define PIN_SPI_SCK CH32_SPI1_SCK
#define PIN_SPI_MISO CH32_SPI1_MISO
#define PIN_SPI_MOSI CH32_SPI1_MOSI
#define SCK PIN_SPI_SCK
#define MISO PIN_SPI_MISO
#define MOSI PIN_SPI_MOSI
#define PIN_SPI_SS PA4
#define SS PIN_SPI_SS
#endif

/* ---- tone(): TIM4, free of PWM pads. ---- */
#define CH32_TONE_TIMER 4
#define CH32_TONE_TIMER_BASE CH32_TIM4_BASE
#define CH32_TONE_TIMER_CLKEN_ADDR 0x4002101cu
#define CH32_TONE_TIMER_CLKEN_MASK 0x00000004u
#define CH32_TONE_TIMER_IRQ CH32_IRQN_TIM4
#define CH32_TONE_TIMER_HANDLER TIM4_IRQHandler
#define CH32_TONE_SHARES_PWM 0
/* CNT and ATRLR are 32 bit on this timer: a 16-bit store would be
 * replicated into both halves. See ch32_registers.h. */
#define CH32_TONE_TIMER_BITS 32

/* ---- Servo: TIM3, free of PWM pads. ---- */
#define CH32_SERVO_TIMER 3
#define CH32_SERVO_TIMER_BASE CH32_TIM3_BASE
#define CH32_SERVO_TIMER_CLKEN_ADDR 0x4002101cu
#define CH32_SERVO_TIMER_CLKEN_MASK 0x00000002u
#define CH32_SERVO_TIMER_IRQ CH32_IRQN_TIM3
#define CH32_SERVO_TIMER_HANDLER TIM3_IRQHandler
#define CH32_SERVO_SHARES_PWM 0
#define CH32_SERVO_TIMER_BITS 16

/* Generic boards have no on-board LED. This placeholder only exists so
 * that the stock examples compile; it is the lowest-numbered pad present
 * on every part in the series. Override it per board or on the command
 * line: --build-property build.extra_flags=-DLED_BUILTIN=PC13 */
#ifndef LED_BUILTIN
#define LED_BUILTIN PA0
#endif
